c130/openfoam/case/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
    
    sym
    {
        type        symmetryPlane;
    }
    
    walls
    {
        type        slip;
    }

    model
    {
        type        kqRWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************* //
